In [2]:
import numpy as np
import pandas as pd

In [3]:
s1 = np.random.randint(10,size = 5)
s2 = np.random.randint(10,size = 5)
s3 = np.random.randint(10,size = 5)

In [7]:
dic = {"var1":s1,"var2":s2,"var3":s3}
dic

{'var1': array([7, 1, 9, 4, 5]),
 'var2': array([3, 0, 1, 3, 4]),
 'var3': array([2, 0, 1, 4, 1])}

In [8]:
db = pd.DataFrame(dic)

In [9]:
db

   var1  var2  var3
0     7     3     2
1     1     0     0
2     9     1     1
3     4     3     4
4     5     4     1

In [10]:
db[0:1]

   var1  var2  var3
0     7     3     2

In [11]:
db.index

RangeIndex(start=0, stop=5, step=1)

In [13]:
db.index = ["a","b","c","d","e"]

In [14]:
db

   var1  var2  var3
a     7     3     2
b     1     0     0
c     9     1     1
d     4     3     4
e     5     4     1

In [15]:
db["c":"e"]

   var1  var2  var3
c     9     1     1
d     4     3     4
e     5     4     1

In [16]:
#delete

In [17]:
db.drop("a",axis = 0)

   var1  var2  var3
b     1     0     0
c     9     1     1
d     4     3     4
e     5     4     1

In [18]:
db

   var1  var2  var3
a     7     3     2
b     1     0     0
c     9     1     1
d     4     3     4
e     5     4     1

In [19]:
db.drop("a",axis = 0,inplace = True)

In [20]:
db

   var1  var2  var3
b     1     0     0
c     9     1     1
d     4     3     4
e     5     4     1

In [1]:
import numpy as np
import pandas as pd

In [2]:
#for variables

In [11]:
a = np.arange(1,10).reshape((3,3))

In [15]:
df = pd.DataFrame(a,columns = ["var1","var2","var3"],index = [1,2,3])

In [16]:
df

   var1  var2  var3
1     1     2     3
2     4     5     6
3     7     8     9

In [17]:
"var1" in df

True

In [18]:
l = ["var1","var2","var5","var7"]

In [19]:
for i in l:
    print(i in df)

True
True
False
False

In [23]:
df["var4"] = df["var1"] * df["var2"]

In [24]:
df

   var1  var2  var3  var4
1     1     2     3     2
2     4     5     6    20
3     7     8     9    56

In [25]:
#deleteting variable

In [29]:
df.drop("var4",axis = 1)

   var1  var2  var3
1     1     2     3
2     4     5     6
3     7     8     9

In [31]:
df

   var1  var2  var3  var4
1     1     2     3     2
2     4     5     6    20
3     7     8     9    56

In [32]:
df.drop("var4",axis = 1,inplace = True)

In [33]:
df

   var1  var2  var3
1     1     2     3
2     4     5     6
3     7     8     9

In [34]:
df["var4"] = df["var1"] * df["var2"] * df["var3"]

In [35]:
df

   var1  var2  var3  var4
1     1     2     3     6
2     4     5     6   120
3     7     8     9   504

In [36]:
l = ["var4","var3"]

In [37]:
df.drop(l,axis = 1)

   var1  var2
1     1     2
2     4     5
3     7     8